import './App.css';
import * as S from './Style'

function App() {
  return (
    <>
<S.Header>국어</S.Header>
<S.Body>
<h1>향수</h1>
넓은 벌 동쪽 끝으로<br />
옛이야기 지줄대는 실개천이 회돌아 나가고,<br />
얼룩백이 황소가<br />
<div>
해설피 금빛 게으른 울음을 우는 곳, <S.HL>청각의 시각화</S.HL><br />
</div>
그곳이 차마 꿈엔들 잊힐 리야.<br />
<br />
<div>
①질화로에 재가 식어지면<S.HL>시간의 경과</S.HL><br />
</div>
<div>
비인 밭에 밤바람 소리 말을 달리고,<S.HL>청각의 사각화 ( {"=>"} 공감각 )</S.HL><br />
</div>
엷은 졸음에 겨운 늙으신 아버지가<br />
②짚베개를 돋아 고이시는 곳,<br />
그곳이 차마 꿈엔들 잊힐 리야.<br /><br />
(①,② 의 공통점 = 가난)<br />
<br />
흙에서 자란 내 마음<br />
파아란 하늘빛이 그리워<br />
함부로 쏜 화살을 찾으려<br />
풀섶 이슬에 함추름 휘적시던 곳,<br />
그곳이 차마 꿈엔들 잊힐 리야.<br />
<br />
전설(傳說)바다에 춤추는 밤물결 같은<br />
검은 귀밑머리 날리는 어린 누이와<br />
아무렇지도 않고 예쁠 것도 없는<br />
사철 발 벗은 아내가(가난)<br />
따가운 햇살을 등에 지고 이삭 줍던 곳(가난),<br />
그곳이 차마 꿈엔들 잊힐 리야.<br />
<br />
하늘에는 성근 별<br />
알 수도 없는 모래성으로 발을 옮기고,<br />
서리 까마귀 우지짖고 지나가는 초라한 지붕(가난),<br />
흐릿한 불빛에 돌아앉아 도란도란거리는 곳,<br />
그곳이 차마 꿈엔들 잊힐 리야.
<br/>
<br/>
<h2>설명</h2>
1연 평화로운 고향의 모습<br/>
2연 겨울밤과 아버지에 대한 추억<br/>
3연 유년기에 대한 추억<br/>
4연 누이동생과 에나애 대한 기억<br/>
5연 단란했던 가족<br/>
<br/>
<b>갈래</b>
자유시, 서정시<br/><br/>
<b>성격</b>
향토적(실개천, 얼룩백이 황소, 질화로, 질벼개)<br/>
감각적(옛~실개천,  금빛~울음. 바람소리~, 말을 달릴)<br/><br />

<h1>내 마음 아실 이</h1>
내 마음을 아실 이<br/>
내 혼자 마음 날(유음)같이 아실 이<br/>
그래도 어데나 계실 것이면<br/>
<br/>
내 마음에 때때로 어리우(울림소리)는 ⓐ티끌(고난, 고민, 번뇌)과<br/>
ⓑ속임 없는 눈물(순수)의 간곡한 방울방울<br/>
푸른 밤 고이 맺는 이슬 같은 ⓒ보람을<br/>
보밴 듯 감추었다 내어드리지<br/>
<br/>

<span>(ⓐ + ⓑ + ⓒ = 보배)</span>
<br/>
<div>
아! 그립다<S.HL>감정의 직접적 표현</S.HL><br/>
</div>
내 혼자 마음 날같이 아실 이<br/>
<div>
꿈에나 아득히 보이는가<S.HL>회의</S.HL><br/>
</div>
<br/>
<div>
향 맑은 옥돌에 불이 달아<S.HL>고결함</S.HL><br/>
</div>
사랑은 타기도 하오(울림소리)련만<br/>
불빛에 연긴 듯 희미론(유음) 마음은<br/>
사랑도 모르리 내 혼자 마음은<br/><br />

<h2>설명</h2>
1연 기대감<br/>
2연 약속<br/>
3연 존재에 대한 회의<br/>
4연 안타까움<br/>
<br/>

<b>갈래</b>
자유시, 서정시<br/><br/>
<b>성격</b> 
낭만적, (여성적)<br/>
주제: 내 마음을 아아줄 이에 대한 간절한 그리움<br/><br/>

<h1>모란이 피기까지는</h1>
모란이 피기까지는<br />
<div>
나는 아직 나의 봄을 기다리고 있을 테요<S.HL>화자의 의지적 태도</S.HL><br />
(기다림)<br />
</div>
모란이 뚝뚝(음성 상징어) 떨어져 버린 날<br />
나는 비로소 봄을 여읜 설움에 잠길 테요<br />
(절망)<br />
오월 어느 날, 그 하루 무덥던 날,<br />
떨어져 누운 꽃잎마저 시들어 버리고는<br />
천지에 모란은 자취도 없어지고,<br />
(절망의 심화)<br />
뻗쳐 오르던 내 보람(모란의 개화를 위한 기다림) 서운케 무너져느니<br />
모란이 지고 말면 그뿐, 내 한해는 다 가고 말아,<br />
삼백 예순 날 하냥 섭섭해 우옵네다(조탁)<br />
모란이 피기까지는<br />
나는 아직 기다리고 있을테요, 찬란한 슬픔의 봄을(역설 1. 모란의 개화, 2. 모란의 낙화)<br/>
<h2>설명</h2>
<b>주제</b>
소망이 이루어지기를 기다림<br/><br />

모란 = 보람 + 소망<br />
봄 = 소망이 실현될 계절<br />
보람 = 소망을 이룬 보람<br />
360 = 마란을 잃은 슬픔의 길이<br />

<h1>고향</h1>
나는 북관(北關)에 혼자 앓아 누워서(외로움)<br/>
어느 아침 의원(醫員)을 뵈이었다.<br/>
<br/>
의원은 여래(如來) 같은 상을 하고 관공(關公)의 수염을 드리워서<br/>
먼 옛적 어느 나라 신선 같은데<br/>
새끼손톱 길게 돋은 손을 내어<br/>
묵묵하니 한참 맥을 짚더니<br/>
문득 물어 고향이 어데냐 한다.<br/>
<br/>
평안도 정주라는 곳이라 한즉<br/>
그러면 아무개 씨 고향이란다.<br/>
그러면 아무개 씨 아느냐 한즉<br/>
의원은 빙긋이 웃음을 띠고<br/>
막역지간(Q1. 친한친구 ( = 죽마고우, 막역지우, 관포지교, 수어지교 ))이라며 수염을 쓸는다.<br/>
<br/>
나는 아버지로 섬기는 이라 한즉<br/>
의원은 또다시 넌지시 웃고<br/>
말없이 팔을 잡아 맥을 보는데<br/>
손길은 따스하고 부드러워<br/>
고향도 아버지도 아버지의 친구도 다 있었다.<br/>
<h2>설명</h2>
대화체 + 이야기시(=서시시)<br/><br/>
<b>감정 변화</b>
외로움 - 반가움 - 그리움<br /><br/>
<b>갈래</b>
자유시, 서정시<br /><br/>
<b>성격</b>
서정적, 서사적<br /><br/>
<b>주제</b>
고향(가족)에 대한 그리움
<h1>여승</h1>
여승(女僧)은 합장(合掌)하고 절을 했다<br />
가지취의 내음새가 났다<br />
<div>
쓸쓸한 낯이 옛날같이 늙었다<S.HL>고통, 고난, 고단함 {"->"} 지속성</S.HL><br />
</div>
나는 불경(佛經)처럼 서러워졌다<br />
<br />
평안도의 어늬 산 깊은 금점판(금광)<br />
나는 파리한 여인(女人)에게서 옥수수를 샀다<br />
여인은 나어린 딸아이를 때리며 가을밤같이 차게 울었다<br />
<br />
섶벌(일벌(방랑))같이 나아간 지아비 기다려 십 년이 갔다<br />
지아비는 돌아오지 않고<br />
어린 딸은 도라지꽃(보라 = 죽음)이 좋아 돌무덤으로 갔다<br />
<br />
산꿩도 설게 울은 슬픈 날이 있었다<br />
산절의 마당귀에 여인의 머리오리가 눈물방울(중의법)과 같이 떨어진 날이 있었다<br />

<h2>설명</h2>
Q1. 1 ~ 4을 시간 순으로 배열<br />
2 - 3 - 4 - 1<br/><br/>

가지취 = 속세와의 단절<br/>
옥수수 = 궁핍, 가난<br/>
산꿩 = 감정이입<br/>
눈물~같이 = 중의적 표현<br/><br/>

갈래: 자유시, 서정시<br/>
성격: 서사적, 애상적, 감각적<br/>
주제: 여승이 된 한 여인의 비극적인 삶<br/><br/>
<h1>문법(어휘)</h1>
(직접 찾아보셈)
</S.Body>
    </>
  );
}

export default App;
